Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/3.2.86/edc/ATSAML11E15A.PIC
      <edc:SFRDef edc:_addr="0x4200012A" edc:access="----nnnn" edc:cname="USER10" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200012B" edc:access="----nnnn" edc:cname="USER11" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200012C" edc:access="----nnnn" edc:cname="USER12" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200012D" edc:access="----nnnn" edc:cname="USER13" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200012E" edc:access="----nnnn" edc:cname="USER14" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4200012F" edc:access="----nnnn" edc:cname="USER15" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000130" edc:access="----nnnn" edc:cname="USER16" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000131" edc:access="----nnnn" edc:cname="USER17" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000132" edc:access="----nnnn" edc:cname="USER18" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000133" edc:access="----nnnn" edc:cname="USER19" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000134" edc:access="----nnnn" edc:cname="USER20" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000135" edc:access="----nnnn" edc:cname="USER21" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000136" edc:access="----nnnn" edc:cname="USER22" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:desc="Channel Event Selection" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42000137" edc:offset="0x9D"/>
      <edc:SFRDef edc:_addr="0x420001D4" edc:access="-------n" edc:cname="INTENCLR" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="NSCHK" edc:desc="Non-Secure Check Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420001D5" edc:access="-------n" edc:cname="INTENSET" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="NSCHK" edc:desc="Non-Secure Check Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420001D6" edc:access="-------n" edc:cname="INTFLAG" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="NSCHK" edc:desc="Non-Secure Check" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x420001D7" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x420001D8" edc:access="------------------------nnnnnnnn" edc:cname="NONSECCHAN" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL0" edc:desc="Non-Secure for Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL1" edc:desc="Non-Secure for Channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL2" edc:desc="Non-Secure for Channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL3" edc:desc="Non-Secure for Channel 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL4" edc:desc="Non-Secure for Channel 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL5" edc:desc="Non-Secure for Channel 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL6" edc:desc="Non-Secure for Channel 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL7" edc:desc="Non-Secure for Channel 7" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420001DC" edc:access="------------------------nnnnnnnn" edc:cname="NSCHKCHAN" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL0" edc:desc="Channel 0 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL1" edc:desc="Channel 1 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL2" edc:desc="Channel 2 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL3" edc:desc="Channel 3 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL4" edc:desc="Channel 4 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL5" edc:desc="Channel 5 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL6" edc:desc="Channel 6 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHANNEL7" edc:desc="Channel 7 to be checked as non-secured" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x420001E0" edc:access="---------nnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NONSECUSER0" edc:impl="0x7FFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="USER0" edc:desc="Non-Secure for User 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER1" edc:desc="Non-Secure for User 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER2" edc:desc="Non-Secure for User 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER3" edc:desc="Non-Secure for User 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER4" edc:desc="Non-Secure for User 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER5" edc:desc="Non-Secure for User 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER6" edc:desc="Non-Secure for User 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER7" edc:desc="Non-Secure for User 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER8" edc:desc="Non-Secure for User 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER9" edc:desc="Non-Secure for User 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER10" edc:desc="Non-Secure for User 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER11" edc:desc="Non-Secure for User 11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER12" edc:desc="Non-Secure for User 12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER13" edc:desc="Non-Secure for User 13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER14" edc:desc="Non-Secure for User 14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER15" edc:desc="Non-Secure for User 15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER16" edc:desc="Non-Secure for User 16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER17" edc:desc="Non-Secure for User 17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER18" edc:desc="Non-Secure for User 18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER19" edc:desc="Non-Secure for User 19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER20" edc:desc="Non-Secure for User 20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER21" edc:desc="Non-Secure for User 21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER22" edc:desc="Non-Secure for User 22" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x420001E4" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x420001F0" edc:access="---------nnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NSCHKUSER0" edc:impl="0x7FFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="USER0" edc:desc="User 0 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER1" edc:desc="User 1 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER2" edc:desc="User 2 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER3" edc:desc="User 3 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER4" edc:desc="User 4 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER5" edc:desc="User 5 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER6" edc:desc="User 6 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER7" edc:desc="User 7 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER8" edc:desc="User 8 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER9" edc:desc="User 9 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER10" edc:desc="User 10 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER11" edc:desc="User 11 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER12" edc:desc="User 12 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER13" edc:desc="User 13 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER14" edc:desc="User 14 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER15" edc:desc="User 15 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER16" edc:desc="User 16 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER17" edc:desc="User 17 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER18" edc:desc="User 18 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER19" edc:desc="User 19 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER20" edc:desc="User 20 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER21" edc:desc="User 21 to be checked as non-secured" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USER22" edc:desc="User 22 to be checked as non-secured" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x420001F4" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x42000200" edc:access="-------w" edc:cname="CTRLA" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
